app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = '123'
 LIMIT 1
---
    public function authenticate()
    {
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari pengguna berdasarkan username
        $user = $model->where('username', $username)->first();