app/Controllers/DashboardController.php

SELECT *
FROM `rooms`
---
    public function index()
    {
        $roomModel = new RoomModel();
        $rooms = $roomModel->findAll();