app/Controllers/RoomController.php

    public function view($id)
    {
        $roomModel = new RoomModel();
        $computerModel = new ComputerModel();

        // Dapatkan data ruangan berdasarkan ID
        $room = $roomModel->find($id);

        if (!$room) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Room with ID $id not found.");
        }

        // Dapatkan semua komputer di dalam ruangan tersebut
        $computers = $computerModel->where('room_id', $id)->findAll();
---
SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '6'
SELECT *
FROM `computers`
WHERE `room_id` = '6'

    public function addComputer()
    {
        $computerModel = new ComputerModel();



        // Ambil data input
        $data = [
            'computer_name' => $this->request->getPost('computer_name'),
            'ip_address'    => $this->request->getPost('ip_address'),
            'room_id'       => $this->request->getPost('room_id'),
        ];

        // Simpan data ke database
        $computerModel->save($data);
---
INSERT INTO `computers` (`computer_name`, `ip_address`, `room_id`) VALUES ('123', '124', '6')